"""
1、面向过程与面向对象

如何把大象装进冰箱里？

开车：


面向过程：
    1、打开冰箱
    2、把大象装进去
    3、关上冰箱

    1、踩离合
    2、打火
    3、挂档
    4、松离合/加油


    做饭：蛋炒饭
        1、鸡蛋准备好
        2、米饭
        3、热锅
        4、放油
        5、辅料
        6、炒
        7、出锅


面向对象：
    找个师傅

    找个司机

    叫个外卖(下馆子)

2、类与对象
        类是抽象的

        类是一个模版：


        对象是具体的：


        对象是类中的具体的某一个



类：    交通工具

   对象： 龙哥的雅迪宝马

类:    小黄车：

   对象：     中午你扫的那辆



先有类，后有对象

对象是类中具体的某一个，类中具备的特点，对象都有


面向对象：类
    Driver:
    司机类：
    类的组成：
        属性：
            姓名，工号，公司，价格
        行为：
            开车

    系统类：
    自定义类：

    使用面向对象思想，分析游戏(类的组成)
    绝地求生






"""

