"""
进制转换问题：
进制： 10进制  0-9

二进制     ：
    0-1
八进制     ：
    0-7
十六进制    ：
    0-9 A-F


num = 100
1100100
转换计算方法：
十进制转其他进制
    10->2
        除以2倒着取余数

    10->8
        除以8倒着取余数

    10->16
        除以16倒着取余数


其他进制转十进制
    10->10
    365   =    5*10^0 + 6*10^1 + 3*10^2



    2->10
        0b1010   =  0*2^0 + 1*2^1 + 0*2^2 + 1*2^3

    8->10
       0o127 = 7*8^0 + 2*8^1 + 1*8^2 =
                7 + 16 + 64 = 87
    16->10
        0x2ab = b*16^0 + a*16^1 + 2*16^2 =   683
                11      160       512



"""
print(bin(100))
print(oct(100))
print(hex(100))

#其他进制转10进制

num =  int('0b1010',2)
print(num)
num = int('0o127',8)
print(num)
num = int('0x2ab',16)
print(num)

