"""
汉字-》组词-》造句-》作文

变量-》语句-》函数-》类


数学运算符：
+:
    1.求和
    2.正号
    3.连接两个字符串
        "a"+"b" = "ab"
-:
    1.求差
    2.负号
*:
    1.求乘积
    2.重复
/：
    1.求商
//:
    1.取整除
/是精确除法，//是向下取整除法，%是求模

**:
    1.求几次幂
    a ** b
    求a的b次方
%：
    取余数


"""
#-------+ 的用途----------
# a = 10
# b = +20
# c = a + b
# print("%d + %d = %d"%(a,b,c))
# str1 = '123'
# str2 = "456"
# str3 = str1+str2
# print(str3)
#------- ‘-’ 的用途----------
# a = 10
# b = -10
# c = a - b
# print("c = %d"%c)
#------- ‘*’ 的用途----------
# a = 5
# b = 6
# c = a * b
# print("c = %d"%c)
# # 重复将Hello打印10次
# print("Hello"*10)
# print("-"*50)
print(4/2)
print(4//2)
print(5//2.0)
print(1//2)

#------- ‘**’ 的用途----------
print(2**8)
#等价于 8的1次方 分之1
print(8**-1)

#------- ‘%’ 的用途----------
print(100%3)
print(5%2)


