"""
赋值运算符
    将右边的常量值赋值左边的变量
    1.单独的赋值
        =
        PI = 3.14


    2.结合的赋值(算术运算符结合)
        +=:
            a,b = 10,20
            a += b
            print(a)
            print(b)
        -=
        *=
        /=
        //=
        **=
        %=

"""
# print(4/2)
# print(4//2)
# print(4.0//2)
# print("%d"%(4/2))
# a,b = 10,20
# print(a)
# print(b)
# c = a = b
# print(a)
# print(c)

# a,b = a+1,a
# print(a)
# print(b)

#------"+="------
a,b = 10,20
# a += b
# #等价于  a = a + b
# #30
# print(a)
# #20
# print(b)

#------"-="------
#a = a - b
# a -= b
# #
# print(a)
# print(b)

#------"*="------
# a = a * b
# a *= b
# print(a)

#------"/="------
a /= b
print(a)

#------"//="------
#------"**="------
#------"%="------


